<?php

use App\API\APIB24RequestService;
use App\Models\Manager;
use App\Models\Product;
use Illuminate\Support\Facades\DB;


function setProduct($str = ''): array
{
    $products = Product::all();
    foreach ($products as $product) {
        if ($product->name_b24 === $str) {
            return [$product->id_billy];
        }
    }
    return [];
}

function setManager($manager, $channel)
{
     if ($manager === null && $channel === 1) {
         return '2149';
     } elseif ($manager !== null) {
         $managers = Manager::all();
         foreach ($managers as $item) {
             if ($item->id_billing === $manager->Code) {
                 return $item->id_b24;
             }
         }
     }
     return '407';
}

function getIdCompany($id)
{
    $request = new APIB24RequestService();
    $id = $request->client->request('POST', 'crm.company.list.json', [
        'form_params' => [
            'filter' => ['=UF_CRM_1441615404' => $id],
            'select' => ['ID'],
        ]
    ]);
    $response = json_decode($id->getBody()->getContents());
    if (!empty($response->total)) {
        return $response->result[0]->ID;
    }
    return '';
}

function setValue($int, $array)
{
    foreach ($array as $item => $value) {
        if ($item == $int) {
            return $value;
        }
    }
    return $item;
}


/**
 * @param $str
 * @return string|null
 */
function setFailStatus($str): ?string
{
    $array = getArray();
    foreach ($array as $item => $value) {
        if ($item === $str && (!is_null($value))) {
            return $value;
        }
    }
    return null;
}

/**
 * @return string[]
 */
function getArray(): array
{
    return [
        'b54c566c-ddff-40f2-8526-001141c49736' => 'C13:6', // Нет потребности
        'e2e47814-5996-43d6-ae07-bd28573a3867' => 'C13:6', // Нет потребности
        'b420ae92-3b5d-4b2b-ad5c-457cce8dfcec' => 'C13:6', // Нет потребности
        'b5e3ad49-0e46-4692-b945-ad616d0b3aac' => 'C13:6', // Нет потребности
        'd4dbd715-3c7e-4594-8c0f-0380fb891262' => 'C13:6', // Нет потребности
        '4dc2d9b5-aa22-439c-9403-1c251c52e392' => 'C13:6', // Нет потребности
        '279a377e-aa98-4d69-905f-3a6abc6662ef' => 'C13:6', // Нет потребности
        '278ea7ab-d4cb-4e23-9f88-095148c5791d' => 'C13:6', // Нет потребности
        '38e932ec-f670-4a11-8e01-2c95d7a0239a' => 'C13:6', // Нет потребности
        '0787aa71-43de-4943-a557-9d4ca4cca0f5' => 'C13:6', // Нет потребности
        '4df62575-9cc2-4dc7-9f81-b900f41ad317' => 'C13:6', // Нет потребности
        'ad25cd48-29b0-41e0-bba4-0c8d3a2b6e69' => 'C13:6', // Нет потребности
        '0bc74737-765c-4970-a36e-3cd51322fb1f' => 'C13:6', // Нет потребности
        'af516bcd-3f2d-4ff4-9141-626d4bb75a0c' => 'C13:6', // Нет потребности
        '7ac49fe5-ab61-4dd7-b8d7-7416e863d38f' => 'C13:6', // Нет потребности
        'd4bb84d8-696f-41a6-9beb-f568ccc51ab7' => 'C13:6', // Нет потребности
        '53dab89b-0b3b-497a-85cd-07fd48d29b26' => 'C13:6', // Нет потребности
        '33f6c9aa-8caa-41a4-aa2f-61c18178a5bc' => 'C13:6', // Нет потребности
        '3acf7cf6-89c1-429c-ae9b-7f0599f675a1' => 'C13:6', // Нет потребности
        '396fcc27-fbdc-46fc-ac15-85e206562fc2' => 'C13:6', // Нет потребности
        'bf45cb26-e426-410b-9719-9090c645eafa' => 'C13:6', // Нет потребности
        '2eef4cc1-42b5-4d47-878c-a1844cb6df0c' => 'C13:6', // Нет потребности
        'ec188f48-83f1-4225-a5d4-bdb645198f85' => 'C13:6', // Нет потребности
        '75f6caec-78ac-4df4-809a-19d76fd89d4c' => 'C13:4', // Дорого
        'e7d43bf4-3b08-4a4a-9955-55e7206fa292' => 'C13:4', // Дорого
        '2c74bdeb-d1b6-42f5-ab81-20c6de265940' => 'C13:4', // Дорого
        'e3872b90-0aa9-4eea-9eb2-bb4da6f1663b' => 'C13:4', // Дорого
        'ecdc17bd-1c59-4c04-bfdb-06d9eef6a64c' => 'C13:4', // Дорого
        'e7a90d9e-91ef-46d3-8090-4e69916a83cd' => 'C13:4', // Дорого
        '041caceb-2768-4ac0-9c16-f19a6f0d9cf3' => 'C13:4', // Дорого
        'b80f2508-9054-4bb5-9846-360c41e7008b' => 'C13:5', // Ушли к конкуренту
        'a0e9da17-b8e4-4dcd-ada2-a253c3c3a33f' => 'C13:5', // Ушли к конкуренту
        '04fad146-1569-42d1-9e57-a3e4119eb293' => 'C13:5', // Ушли к конкуренту
        '04c60b15-589f-4a00-a8f4-14111cebd003' => 'C13:5', // Ушли к конкуренту
        'f872f2c4-d88f-4caf-bfd7-932b1f59544c' => 'C13:5', // Ушли к конкуренту
        '11f53efd-6ffc-417d-b733-deaa3922a815' => 'C13:5', // Ушли к конкуренту
        '1b14243a-1ad3-404f-8cfd-25049e8a85f1' => 'C13:5', // Ушли к конкуренту
        'be7d40f2-7a6a-4e8c-b805-a59e0b444686' => 'C13:5', // Ушли к конкуренту
        '1f6cc7cf-8af9-4f96-a5a8-fe387c8eebc6' => 'C13:5', // Ушли к конкуренту
        '846b78fb-46d1-4452-9fb8-6c3c9ccbd9fb' => 'C13:5', // Ушли к конкуренту
        'cfa254cc-985f-49ad-bcd7-6e8b4e555a92' => 'C13:5', // Ушли к конкуренту
        '090a4ad8-8bdf-4485-adef-92ce26df838f' => 'C13:5', // Ушли к конкуренту
        '86d622f7-802c-4cae-ba60-b7fb7b4ad01e' => 'C13:5', // Ушли к конкуренту
        '8ee56b27-aeb1-48a1-974f-c2417a45a711' => 'C13:5', // Ушли к конкуренту
        'f5dc2da3-4e7e-43fe-88ae-7c11c02570cf' => 'C13:9', // Реорганизация/ликвидация
        '7533c240-b8d9-42cc-aef2-f168c052ea4f' => 'C13:9', // Реорганизация/ликвидация
        '9cc7a04f-c976-4b37-989b-ce244fc1ae76' => 'C13:9', // Реорганизация/ликвидация
        '8f5223ea-7884-41cf-ae1a-040481a4f376' => 'C13:9', // Реорганизация/ликвидация
        '2d5ce18a-e917-4ae2-8f85-1d6337c862f3' => 'C13:9', // Реорганизация/ликвидация
        'bcd60ee3-8743-4062-8926-ba836d4fe784' => 'C13:9', // Реорганизация/ликвидация
        '7d38ae28-453c-4018-96a2-f55f13d0023f' => 'C13:9', // Реорганизация/ликвидация
        '2e9fb20a-9fcf-42f5-9a2d-81c7264ef5c8' => 'C13:8', // Вошли в состав ОБ/ПКД
        '1455bd26-7757-4639-8d11-3b047df49407' => 'C13:8', // Вошли в состав ОБ/ПКД
        '8ffb3625-c86a-41b6-a06f-90594e89ae21' => 'C13:8', // Вошли в состав ОБ/ПКД
        'dc80ec2d-1de3-415e-833b-6c6532c952a7' => 'C13:8', // Вошли в состав ОБ/ПКД
        'af473214-0514-4266-8559-639c575a1bf2' => 'C13:8', // Вошли в состав ОБ/ПКД
        '0b0fd207-0d4a-4a01-8759-9d786f17f249' => 'C13:8', // Вошли в состав ОБ/ПКД
        '78248467-9d76-4117-a7da-90810dcc86ab' => 'C13:2', // Отказ общаться
        '727a17aa-1e3f-47e1-a1e9-9d216c3e9727' => 'C13:2', // Отказ общаться
        '52c07a6c-ca37-493b-8d0a-5509bc9d41ed' => 'C13:2', // Отказ общаться
        '5ff514e6-4f2b-448c-b8f0-d2d0d9289c63' => 'C13:2', // Отказ общаться
        '0f15d0b8-ab62-422c-9fcc-af8760328164' => 'C13:2', // Отказ общаться
        'a9f23d31-4025-498c-a197-c1cdd3a55cbe' => 'C13:2', // Отказ общаться
        '640eab2e-003d-4ba7-a699-39d4d443965c' => 'C13:2', // Отказ общаться
        '762f090c-f975-4b3e-bb48-b13a6a8993aa' => 'C13:10', // Недоработка менеджера
        '3a1fecc4-4362-4d33-a01f-83e42bc6bb8e' => 'C13:10', // Недоработка менеджера
        '082ce9df-6d14-4041-bad8-ff191f7a78bf' => 'C13:10', // Недоработка менеджера
        '985abb86-0c8c-4eda-a3c6-d4bd1c0d3902' => 'C13:10', // Недоработка менеджера
        'c23bddca-5856-4b1d-9969-a3c7448da6d8' => 'C13:10', // Недоработка менеджера
        'bdf79f48-a963-4bf1-8677-d1cf359f9bd3' => 'C13:7', // Переход на альтернативный продукт СКБ Контур
        'afbd42b9-b0e2-4415-a219-01c80851d4ab' => 'C13:7', // Переход на альтернативный продукт СКБ Контур
        'e97f1a0b-d7e6-4c37-9400-2c3e16e478b0' => 'C13:7', // Переход на альтернативный продукт СКБ Контур
        '5ab0b281-8e99-442c-99cf-af4502eb6a82' => 'C13:7', // Переход на альтернативный продукт СКБ Контур
        '1ceb1527-cad5-4925-b609-706116012651' => 'C13:7', // Переход на альтернативный продукт СКБ Контур
        '8fc833ae-4d74-485f-8f64-3a41ffca9abb' => 'C13:7', // Переход на альтернативный продукт СКБ Контур
        '67a6bc9c-6dde-4973-90c9-ee666527d311' => 'C13:LOSE', // Ошибочная сделка
        '75fd3d37-a1b8-453c-a2ea-c10f20cbafbf' => 'C13:LOSE', // Ошибочная сделка
        '78e120c1-af4b-4b25-9da7-2b3f72288698' => 'C13:LOSE', // Ошибочная сделка
        '263c2d77-43c3-4774-a5f5-745898f6ecf6' => 'C13:LOSE', // Ошибочная сделка
        '26afaf4a-3028-4872-a335-f1731d56b73c' => 'C13:LOSE', // Ошибочная сделка
        'af714252-471a-4911-a5f5-1f8fbcdc03ad' => 'C13:LOSE', // Ошибочная сделка
        'd0040142-9de0-4f7e-93bd-90dbb4a2cd43' => 'C13:LOSE', // Ошибочная сделка
        'ea3ea241-d1a8-44e7-9a62-d5a3e4659d35' => 'C13:LOSE', // Ошибочная сделка
        '820a9935-2381-45a2-b520-7a8f86e3287d' => 'C13:LOSE', // Ошибочная сделка
        '646ae005-0818-466a-a3ed-f62f325c7aad' => 'C13:1', // Нет контактов
        '59ea76ce-0097-4fa1-811d-3ea97ad025b5' => 'C13:1', // Нет контактов
        '8def8c56-4351-4d80-9f6e-ebd3260b8af7' => 'C13:1', // Нет контактов
        'ff503af0-9731-4386-bed2-12a29acef567' => 'C13:1', // Нет контактов
        '08b8c766-8c69-4abd-82dc-9fbb4adc1ab8' => 'C13:1', // Нет контактов
        'ac02df18-2a56-4e70-8cac-b36b4578b90a' => 'C13:1', // Нет контактов
        '51868184-28be-4ddd-9b9a-b575e6c0aa8b' => 'C13:1', // Нет контактов
        '898373d5-0d4e-4186-aa66-2822de0ceb96' => 'C13:1', // Нет контактов
        'd0d78398-390b-448f-b7aa-7b50b4b43e2b' => 'C13:1', // Нет контактов
        '59cc2dd7-8d41-46f0-af12-9f99d060ab5d' => 'C13:1', // Нет контактов
        'a93d2baf-0b33-4f0d-a251-e759d666f984' => 'C13:1', // Нет контактов
        '27cfe0cb-8103-4f19-9e1d-4749dcdb150a' => 'C13:15', // Не устраивает качество/функционал продукта
    ];
}
